tom38121605/sample_mcu_STM32C011F6_all/_10_02_bootload跳转示例_ok/对测8-tx-bootload-led-可自动补足最后8个字节-ok/ledprj1-63-af-add-define-GOBOOTLOAD-k/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention


  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdio.h>           //add for sprintf
#include "string.h"          //add for memcmp
#include "stm32c0xx_hal_flash.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

static FLASH_EraseInitTypeDef EraseInitStruct;
uint32_t PageError = 0;

extern volatile uint8_t flg_rx;
extern volatile uint8_t irxdata[RXDATALEN+2];
extern volatile uint8_t irxdata2[RXDATALEN+2];

extern volatile uint32_t irxcount;
extern volatile uint32_t irxcount2;

extern volatile uint8_t flg_timer1;

 
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */


/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */


void iputs1(char *msg)
{
   while(*msg)
   Send_Data_To_UART1(*msg++);   
}


void iputbytes1(uint8_t *msg, uint32_t ilen)
{
   while(ilen--)
   Send_Data_To_UART1(*msg++);
}

void Send_Data_To_UART1 (uint8_t c)
{
   USART1->TDR = c;
   while( (USART1-> ISR & (1<<7) ) ==0 );
}


void delay_count(uint32_t icount)
{
   uint32_t inum = icount;
   while (inum--) ;
}

void software_reset(void)
{
   NVIC_SystemReset();
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
   //--uint8_t ivalue=0;
   
   
   SCB->VTOR = FLASH_BASE | 0x3000;   

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  LL_APB2_GRP1_EnableClock(LL_APB2_GRP1_PERIPH_SYSCFG);
  LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);

  /* SysTick_IRQn interrupt configuration */
  NVIC_SetPriority(SysTick_IRQn, 3);

  LL_SYSCFG_EnablePinRemap(LL_SYSCFG_PIN_RMP_PA11);
  LL_SYSCFG_EnablePinRemap(LL_SYSCFG_PIN_RMP_PA12);

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  //MX_TIM1_Init();
  /* USER CODE BEGIN 2 */
  //--LL_RCC_ConfigMCO(LL_RCC_MCO1SOURCE_SYSCLK, LL_RCC_MCO1_DIV_4);   //12Mhz = 48Mhz/4

  iputs1("st3\r\n");

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
   
   while(1)
   {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
	  static uint32_t imaincount=0;
      __IO uint32_t idata32 = 0;  

      iputs1("run2\r\n");

      LL_mDelay(500);
      LL_GPIO_TogglePin(LED_GPIO_Port,LED_Pin);      

      if(imaincount++>=10)
      {
         imaincount=0;

         // ------------- write flash -----------------
         
         //read flash 
         idata32 = 0x02020202; iputbytes1( (uint8_t*)(&idata32), 4);  //--test           
         idata32 = *(__IO uint32_t *)(0x8007000);  
         iputbytes1( (uint8_t*)(&idata32), 4);  
         
         //erease flash 
         HAL_FLASH_Unlock();

         __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR);

////         EraseInitStruct.TypeErase   = FLASH_TYPEERASE_PAGES;
////         EraseInitStruct.Page        = 14;                        //FLASH_FLAG_PAGE     //7000
////         EraseInitStruct.NbPages     = 1;                         //1 x 800    

////         if (HAL_FLASHEx_Erase(&EraseInitStruct, &PageError) != HAL_OK)
////         {
////            ;//iputbytes1( (uint8_t*)"erase flash err\r\n", 17);     
////         } 
         
         //write flash
         if (HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, 0x8007000, 0xffffffff00000000+GOBOOTLOAD ) != HAL_OK)
         {
            ;//iputbytes1( (uint8_t*)"save flash err\r\n", 16);  
         }   
         
         //read flash 
         idata32 = 0x03030303; iputbytes1( (uint8_t*)(&idata32), 4);  //--test    
         idata32 = *(__IO uint32_t *)(0x8007000);  
         
         //if(idata32!=GOBOOTLOAD)
           iputbytes1( (uint8_t*)(&idata32), 4);  
         
         HAL_FLASH_Lock();      
         
         // ------------- write flash ---end--------------

         //iputbytes1( (uint8_t*)"reset\r\n", 7); 
         
         __set_PRIMASK(1);
         software_reset();
      }

   }

  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  LL_FLASH_SetLatency(LL_FLASH_LATENCY_1);

  /* HSI configuration and activation */
  LL_RCC_HSI_Enable();
  while(LL_RCC_HSI_IsReady() != 1)
  {
  }

  LL_RCC_HSI_SetCalibTrimming(64);
  LL_RCC_SetHSIDiv(LL_RCC_HSI_DIV_1);
  /* Set AHB prescaler*/
  LL_RCC_SetAHBPrescaler(LL_RCC_HCLK_DIV_1);

  /* Sysclk activation on the HSI */
  LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_HSI);
  while(LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_HSI)
  {
  }

  /* Set APB1 prescaler*/
  LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_1);
  LL_Init1msTick(48000000);
  /* Update CMSIS variable (which can be updated also through SystemCoreClockUpdate function) */
  LL_SetSystemCoreClock(48000000);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
   /* User can add his own implementation to report the HAL error return state */
   __disable_irq();
   while (1)
   {
   }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
   /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
